<a href="https://colab.research.google.com/github/nurindahfidiawati/Datamining/blob/master/Adult_All_Atribut.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:

import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB

In [ ]:

df = pd.read_csv("adult.csv")
df
# df.head()
# print(df.to_string())

       age     workclass  fnlwgt  ... hours-per-week  native-country income
0       25       Private  226802  ...             40   United-States  <=50K
1       38       Private   89814  ...             50   United-States  <=50K
2       28     Local-gov  336951  ...             40   United-States   >50K
3       44       Private  160323  ...             40   United-States   >50K
4       18             ?  103497  ...             30   United-States  <=50K
...    ...           ...     ...  ...            ...             ...    ...
48837   27       Private  257302  ...             38   United-States  <=50K
48838   40       Private  154374  ...             40   United-States   >50K
48839   58       Private  151910  ...             40   United-States  <=50K
48840   22       Private  201490  ...             20   United-States  <=50K
48841   52  Self-emp-inc  287927  ...             40   United-States   >50K

[48842 rows x 15 columns]

In [ ]:

# hilangkan atribut non numerik
df.drop(['workclass', 'education', 'marital-status', 'occupation', 'relationship', 'race', 'native-country'],axis='columns',inplace=True)
df.head()

   age  fnlwgt  educational-num  ... capital-loss  hours-per-week  income
0   25  226802                7  ...            0              40   <=50K
1   38   89814                9  ...            0              50   <=50K
2   28  336951               12  ...            0              40    >50K
3   44  160323               10  ...            0              40    >50K
4   18  103497               10  ...            0              30   <=50K

[5 rows x 8 columns]

In [ ]:

#pisahkan atribut dengan class
inputs = df.drop('income',axis='columns')
# drop class
target = df.income
# tampung class

In [ ]:

# buat data dummies gender 
dummies = pd.get_dummies(inputs.gender)
dummies.head(3)

   Female  Male
0       0     1
1       0     1
2       0     1

In [ ]:

# tampilkan dummies dan gabungkan female 0 / male 1
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(4)

   age  fnlwgt  educational-num  ... hours-per-week  Female  Male
0   25  226802                7  ...             40       0     1
1   38   89814                9  ...             50       0     1
2   28  336951               12  ...             40       0     1
3   44  160323               10  ...             40       0     1

[4 rows x 9 columns]

In [ ]:

# drop bagian male
# inputs.drop(['gender','Male'],axis='columns',inplace=True)
# inputs.head(3)

In [ ]:

# drop bagian female
inputs.drop(['gender','Female'],axis='columns',inplace=True)
inputs.head(4)

   age  fnlwgt  educational-num  ...  capital-loss  hours-per-week  Male
0   25  226802                7  ...             0              40     1
1   38   89814                9  ...             0              50     1
2   28  336951               12  ...             0              40     1
3   44  160323               10  ...             0              40     1

[4 rows x 7 columns]

In [ ]:

#cek variabel terdapat yag null / kosong ?
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [ ]:

# pada bagian age yang null isi dengan nilai rata - rata 
inputs.age = inputs.age.fillna(inputs.age.mean())
inputs.head()

   age  fnlwgt  educational-num  ...  capital-loss  hours-per-week  Male
0   25  226802                7  ...             0              40     1
1   38   89814                9  ...             0              50     1
2   28  336951               12  ...             0              40     1
3   44  160323               10  ...             0              40     1
4   18  103497               10  ...             0              30     0

[5 rows x 7 columns]

In [ ]:

#tampilkan class
# iris = df.variety
target.head()

0    <=50K
1    <=50K
2     >50K
3     >50K
4    <=50K
Name: income, dtype: object

In [ ]:

#training set dan testing set
#cek random state ya dengan perbandingan 0,2 / 100 / 20%
#X_train, X_test, y_train, y_test = train_test_split(inputs, target,test_size=0.2, random_state = 100)


#cek random state ya dengan perbandingan 0,3 / 100 / 30%
#X_train, X_test, y_train, y_test = train_test_split(inputs, target,test_size=0.3, random_state = 100)


#cek random state ya dengan perbandingan 0,4 / 100 / 40%
X_train, X_test, y_train, y_test = train_test_split(inputs, target,test_size=0.4, random_state = 100)

In [ ]:

# hitung akurasinya
model = GaussianNB()
model.fit(X_train,y_train)
model.score(X_test,y_test)

0.794953165787992

In [ ]:

# test atribut acak dengan jumlah sebanyak 10 dari var x_test
X_test[0:10]

       age  fnlwgt  educational-num  ...  capital-loss  hours-per-week  Male
12393   37  110331               15  ...             0              60     0
48701   23   45834               13  ...             0              50     0
17918   28   89718                9  ...             0              48     0
11352   30  351770                5  ...             0              38     0
36198   31  164190                6  ...             0              40     1
14102   18  211683                8  ...             0              20     1
41731   28  452808                6  ...             0              40     1
23995   47  123681               14  ...             0              60     1
36248   37  151771                4  ...             0              40     1
12244   76   82628                4  ...             0              45     1

[10 rows x 7 columns]

In [ ]:

# test jenis class dari atribut yang digunakan sebelumnya
y_test[0:10]

12393     >50K
48701    <=50K
17918    <=50K
11352    <=50K
36198    <=50K
14102    <=50K
41731    <=50K
23995     >50K
36248    <=50K
12244    <=50K
Name: income, dtype: object

In [ ]:

# mencetak model prediksi dari variabel X_Test dengan parameter var dan iris
model.predict(X_test[0:10])

array(['<=50K', '<=50K', '<=50K', '<=50K', '<=50K', '<=50K', '<=50K',
       '>50K', '<=50K', '<=50K'], dtype='<U5')

In [ ]:

# probabilitas yang hasilnya besar merupakan hasil yang akan digunakan sebagai prediksi
model.predict_proba(X_test[:10])

array([[9.67357192e-01, 3.26428079e-02],
       [9.94012448e-01, 5.98755246e-03],
       [9.23378819e-01, 7.66211813e-02],
       [9.97577294e-01, 2.42270556e-03],
       [9.96105307e-01, 3.89469291e-03],
       [9.99613150e-01, 3.86850272e-04],
       [9.97866734e-01, 2.13326580e-03],
       [9.07700732e-15, 1.00000000e+00],
       [9.95347007e-01, 4.65299288e-03],
       [9.95228470e-01, 4.77153012e-03]])